In [47]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [48]:
%%sql
sqlite:///CourseData.db

'Connected: @CourseData.db'

In [49]:
%%sql
SELECT DISTINCT primary_instructor
FROM INSTRUCTOR 
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('Michael P.  Coyne',),
 ('Rebecca I.  Bloch',),
 ('Paul   Caster',),
 ('Jo Ann   Drusbosky',),
 ('Arleen N.  Kardos',),
 ('Scott M  Brenner',),
 ('Kevin C.  Cassidy',),
 ('Bruce   Bradford',),
 ('Milo W.  Peck',),
 ('Stephen E.  Yost',)]

In [50]:
%%sql
SELECT DISTINCT location, CRN
FROM COURSE_MEETING
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[('DSB 105', '70384'),
 ('DSB 105', '70385'),
 ('DSB 105', '70382'),
 ('DSB 111', '70291'),
 ('DSB 111', '70350')]

In [60]:
%%sql
SELECT DISTINCT (primary_instructor) AS Teacher, COUNT(section) AS Section
FROM COURSE_OFFERING 
WHERE act > 10
GROUP BY primary_instructor, section
ORDER BY section DESC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('Nancy A.  Moriber', 42),
 ('Michael P.  Pagano', 26),
 ('Virginia A.  Kelly', 24),
 ('Kathi M.  Mettler', 23),
 ('Jeffrey N.  Denenberg', 22),
 ('Deborah L.  Edelman', 21),
 ('Erica E.  Hartwell', 20),
 ('Lisa A.  Mainiero', 20),
 ('Ryan P.  Colwell', 20),
 ('Amalia I.  Rusu', 19)]

In [45]:
%%sql
SELECT AVG(Count), (SELECT COUNT(section) FROM COURSE_OFFERING WHERE term = 'Fall2018') AS Count
FROM COURSE_OFFERING 
WHERE term = 'Fall2018';

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such column: Count [SQL: "SELECT AVG(Count), (SELECT COUNT(section) FROM COURSE_OFFERING WHERE term = 'Fall2018') AS Count\nFROM COURSE_OFFERING \nWHERE term = 'Fall2018';"] (Background on this error at: http://sqlalche.me/e/e3q8)

In [59]:
%%sql
SELECT DISTINCT (primary_instructor) AS Teacher, COUNT(section) AS Section
FROM COURSE_OFFERING 
WHERE term = 'Fall2018' AND act > 10
GROUP BY primary_instructor, section
ORDER BY section DESC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('Sonya R.  Huber', 5),
 ('Nancy A.  Moriber', 4),
 ('Amalia I.  Rusu', 3),
 ('Dorothea D.  Braginsky', 3),
 ('James E.  Biardi', 3),
 ('Jeffrey I.  Kramer', 3),
 ('Lucrecia   Garcia Iommi', 3),
 ('Mary Sallyanne   Ryan', 3),
 ('Michael P.  Pagano', 3),
 ('Michael Walden  Creane', 3)]

In [ ]:
Where does x teacher teach x class?